app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page =>params[:page], :per_page => 8)
---
SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def create
    @pin =  current_user.pins.build(pin_params)

    if @pin.save
---
INSERT INTO "pins" ("description", "string", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "this pin should have a user"], ["string", ""], ["user_id", 2], ["created_at", "2016-05-27 09:10:55.526701"], ["updated_at", "2016-05-27 09:10:55.526701"]]

  def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "this is the description!"], ["updated_at", "2016-05-27 06:32:05.832760"], ["id", 1]]